In [1]:
!pip install faker
!pip install names_dataset

Requirement already satisfied: faker in /home/shaghayegh/anaconda3/envs/ML/lib/python3.7/site-packages (14.2.0)
Requirement already satisfied: python-dateutil>=2.4 in /home/shaghayegh/anaconda3/envs/ML/lib/python3.7/site-packages (from faker) (2.8.2)
Requirement already satisfied: typing-extensions>=3.7.4.3 in /home/shaghayegh/anaconda3/envs/ML/lib/python3.7/site-packages (from faker) (4.1.1)
Requirement already satisfied: six>=1.5 in /home/shaghayegh/anaconda3/envs/ML/lib/python3.7/site-packages (from python-dateutil>=2.4->faker) (1.16.0)
Requirement already satisfied: names_dataset in /home/shaghayegh/anaconda3/envs/ML/lib/python3.7/site-packages (3.1.0)
Requirement already satisfied: pycountry in /home/shaghayegh/anaconda3/envs/ML/lib/python3.7/site-packages (from names_dataset) (22.3.5)
Requirement already satisfied: setuptools in /home/shaghayegh/anaconda3/envs/ML/lib/python3.7/site-packages (from pycountry->names_dataset) (61.2.0)

In [37]:
import pandas as pd
import numpy as np

In [38]:
from faker import Faker

In [39]:
en_fake = Faker()
fa_fake = Faker('fa')

In [40]:
from names_dataset import NameDataset

nd = NameDataset()

In [41]:
def make_name():
    if np.random.rand() > 0.5:
        return en_fake.name()
    return fa_fake.name()

In [42]:
df = pd.DataFrame({
    'Name': [make_name() for _ in range(10)]
})

# Extract First name and Last name

In [79]:
def get_fname_lname(name):
    first_name, *_, last_name = name.split()
    return first_name, last_name

In [80]:
df['First Name'] = df['Name'].apply(
    lambda full_name: full_name.split()[0]
)

In [81]:
df['Last Name'] = df['Name'].apply(
    lambda full_name: full_name.split()[-1]
)

In [82]:
df

                         Name First Name Last Name
0                   مهسا حسنی       مهسا      حسنی
1              Timothy Brooks    Timothy    Brooks
2  سرکار خانم دکتر حلما دادفر      سرکار     دادفر
3              Kimberly Riggs   Kimberly     Riggs
4             Margaret Arnold   Margaret    Arnold
5                Jose Jackson       Jose   Jackson
6              Zachary Mendez    Zachary    Mendez
7             Amanda Carrillo     Amanda  Carrillo
8              Darrell Howell    Darrell    Howell
9               حسين علی شاهی       حسين      شاهی

# Predict Gender

In [83]:
def name_to_gender(first_name):
    info = nd.search(first_name)['first_name']
    if info is None:
        return None
    
    return max(info['gender'], key=info['gender'].get)

In [84]:
# For unknown names, it returns None
name_to_gender("drdufj")

In [85]:
name_to_gender("سیامک")

'Male'

In [86]:
df['Gebder'] = df['First Name'].apply(name_to_gender)

In [87]:
df

                         Name First Name Last Name  Gebder
0                   مهسا حسنی       مهسا      حسنی  Female
1              Timothy Brooks    Timothy    Brooks    Male
2  سرکار خانم دکتر حلما دادفر      سرکار     دادفر    None
3              Kimberly Riggs   Kimberly     Riggs  Female
4             Margaret Arnold   Margaret    Arnold  Female
5                Jose Jackson       Jose   Jackson    Male
6              Zachary Mendez    Zachary    Mendez    Male
7             Amanda Carrillo     Amanda  Carrillo  Female
8              Darrell Howell    Darrell    Howell    Male
9               حسين علی شاهی       حسين      شاهی    Male

# Gender Probibility

In [122]:
def gender_prob(first_name):
    probibility = nd.search(first_name)['first_name']
    if probibility is None:
        return None
    return probibility['gender'].get(max(probibility['gender']))

In [123]:
gender_prob('ali')

0.942

In [124]:
df['Gender Probibility'] = df['First Name'].apply(gender_prob)

In [125]:
df

                         Name First Name Last Name  Gebder  Gender Probibility
0                   مهسا حسنی       مهسا      حسنی  Female               0.056
1              Timothy Brooks    Timothy    Brooks    Male               0.988
2  سرکار خانم دکتر حلما دادفر      سرکار     دادفر    None                 NaN
3              Kimberly Riggs   Kimberly     Riggs  Female               0.010
4             Margaret Arnold   Margaret    Arnold  Female               0.007
5                Jose Jackson       Jose   Jackson    Male               0.981
6              Zachary Mendez    Zachary    Mendez    Male               0.990
7             Amanda Carrillo     Amanda  Carrillo  Female               0.013
8              Darrell Howell    Darrell    Howell    Male               0.986
9               حسين علی شاهی       حسين      شاهی    Male               0.973

# Country

In [139]:
def country(first_name):
    info = nd.search(first_name)['first_name']
    if info is None:
        return None
    return max(info['country'])

In [140]:
df['Country'] = df['First Name'].apply(country)

In [141]:
df

,Name,First Name,Last Name,Gebder,Gender Probibility,Country
0,مهسا حسنی,مهسا,حسنی,Female,0.056,United Arab Emirates
1,Timothy Brooks,Timothy,Brooks,Male,0.988,United States
2,سرکار خانم دکتر حلما دادفر,سرکار,دادفر,None,NaN,None
3,Kimberly Riggs,Kimberly,Riggs,Female,0.010,United States
4,Margaret Arnold,Margaret,Arnold,Female,0.007,United States
5,Jose Jackson,Jose,Jackson,Male,0.981,United States
6,Zachary Mendez,Zachary,Mendez,Male,0.990,United States
7,Amanda Carrillo,Amanda,Carrillo,Female,0.013,United States
8,Darrell Howell,Darrell,Howell,Male,0.986,United States
9,حسين علی شاهی,حسين,شاهی,Male,0.973,Yemen